In [1]:
import pandas as pd

In [3]:
s1 = pd.read_csv('titanic.csv', usecols=['Age']).squeeze('columns')

In [4]:
s1.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    27.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [9]:
s1.describe()

count    887.000000
mean      29.471443
std       14.121908
min        0.420000
25%       20.250000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [17]:
s1.sort_values(ascending =False)

627    80.00
847    74.00
490    71.00
95     71.00
115    70.50
       ...
77      0.83
466     0.75
641     0.75
751     0.67
799     0.42
Name: Age, Length: 887, dtype: float64

In [21]:
s1.sort_values(ascending =False).head(8)

627    80.0
847    74.0
490    71.0
95     71.0
115    70.5
669    70.0
741    70.0
535    69.0
Name: Age, dtype: float64

In [14]:
s1.sort_values(ascending =False).head(10).tail(1)

508    66.0
Name: Age, dtype: float64

In [15]:
def age_rank (rank):
    return s1.sort_values(ascending =False).head(rank).tail(1)

In [16]:
age_rank (2)

847    74.0
Name: Age, dtype: float64

# Data Frame

In [22]:
df = pd.read_csv('titanic.csv')

In [24]:
df.head(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708

In [25]:
df.tail(7)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
880,0,3,Mr. Henry Jr Sutehall,male,25.0,0,0,7.050
881,0,3,Mrs. William (Margaret Norton) Rice,female,39.0,0,5,29.125
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.450
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.750

In [26]:
df= pd.read_csv('mls_salaries.csv')

In [27]:
df.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [30]:
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [32]:
df['last_name']

pandas.core.series.Series

In [ ]:
type(df['last_name'])

In [34]:
df[['last_name', 'first_name']]

    last_name first_name
0     Almiron     Miguel
1     Ambrose      Mikey
2        Asad      Yamil
3       Bloom       Mark
4    Carleton     Andrew
..        ...        ...
610   Teibert    Russell
611  Tornaghi      Paolo
612    Waston    Kendall
613       NaN        NaN
614  Williams    Sheanon

[615 rows x 2 columns]

In [36]:
#df[['last_name', 'first_name']]
column_list= ['last_name', 'first_name']
df[column_list]

    last_name first_name
0     Almiron     Miguel
1     Ambrose      Mikey
2        Asad      Yamil
3       Bloom       Mark
4    Carleton     Andrew
..        ...        ...
610   Teibert    Russell
611  Tornaghi      Paolo
612    Waston    Kendall
613       NaN        NaN
614  Williams    Sheanon

[615 rows x 2 columns]

In [37]:
x =df['club']

In [38]:
type(x)

pandas.core.series.Series

In [39]:
df = pd.read_csv('titanic.csv')

In [40]:
df.index

RangeIndex(start=0, stop=887, step=1)

In [41]:
s1.index

RangeIndex(start=0, stop=887, step=1)

In [42]:
#s1.values
df.values

array([[0, 3, 'Mr. Owen Harris Braund', ..., 1, 0, 7.25],
       [1, 1, 'Mrs. John Bradley (Florence Briggs Thayer) Cumings', ...,
        1, 0, 71.2833],
       [1, 3, 'Miss. Laina Heikkinen', ..., 0, 0, 7.925],
       ...,
       [0, 3, 'Miss. Catherine Helen Johnston', ..., 1, 2, 23.45],
       [1, 1, 'Mr. Karl Howell Behr', ..., 0, 0, 30.0],
       [0, 3, 'Mr. Patrick Dooley', ..., 0, 0, 7.75]], dtype=object)

In [46]:
#s1.shape
df.shape

(887, 8)

In [47]:
df.ndim

2

In [48]:
s1.axes

[RangeIndex(start=0, stop=887, step=1)]

In [49]:
df.axes

[RangeIndex(start=0, stop=887, step=1),
 Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
        'Parents/Children Aboard', 'Fare'],
       dtype='object')]

In [52]:
type(df)

pandas.core.frame.DataFrame

In [53]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [54]:
s1.columns

AttributeError: 'Series' object has no attribute 'columns'

In [58]:
df['Age'].add(112)

0      134.0
1      150.0
2      138.0
3      147.0
4      147.0
       ...
882    139.0
883    131.0
884    119.0
885    138.0
886    144.0
Name: Age, Length: 887, dtype: float64

In [59]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
882    27.0
883    19.0
884     7.0
885    26.0
886    32.0
Name: Age, Length: 887, dtype: float64

In [60]:
df['Age'] = df['Age'].add(112)

In [62]:
df.head(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,134.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,150.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,138.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,147.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,147.0,0,0,8.0500
5,0,3,Mr. James Moran,male,139.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,166.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,114.0,3,1,21.0750
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,139.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,126.0,1,0,30.0708

In [70]:
df.insert (2,column='StamColumn', value=' Tra La La')

In [71]:
df.head()

,Survived,Pclass,StamColumn,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Tra La La,Mr. Owen Harris Braund,male,134.0,1,0,7.2500
1,1,1,Tra La La,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,150.0,1,0,71.2833
2,1,3,Tra La La,Miss. Laina Heikkinen,female,138.0,0,0,7.9250
3,1,1,Tra La La,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,147.0,1,0,53.1000
4,0,3,Tra La La,Mr. William Henry Allen,male,147.0,0,0,8.0500

In [72]:
df.count()

Survived                   887
Pclass                     887
StamColumn                 887
Name                       887
Sex                        887
Age                        887
Siblings/Spouses Aboard    887
Parents/Children Aboard    887
Fare                       887
dtype: int64

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   StamColumn               887 non-null    object
 3   Name                     887 non-null    object
 4   Sex                      887 non-null    object
 5   Age                      887 non-null    float64
 6   Siblings/Spouses Aboard  887 non-null    int64
 7   Parents/Children Aboard  887 non-null    int64
 8   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(3)
memory usage: 62.5+ KB

In [75]:
df1 = pd.read_csv('mls_salaries.csv')

In [76]:
df1.count()

club                       614
last_name                  614
first_name                 610
position                   604
base_salary                614
guaranteed_compensation    614
dtype: int64

In [78]:
df['Pclass'].value_counts()

3    487
1    216
2    184
Name: Pclass, dtype: int64

In [79]:
df['Pclass'].value_counts().count()

3

In [84]:
df['Pclass'].nunique()

3

In [85]:
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [86]:
df['Pclass'].value_counts(normalize= True)

3    0.549042
1    0.243517
2    0.207441
Name: Pclass, dtype: float64

In [87]:
df = pd.read_csv('titanic.csv')

In [88]:
df['Age'].median()

28.0

In [89]:
df['Pclass'].mode()

0    3
dtype: int64

In [90]:
df['Age'].describe()

count    887.000000
mean      29.471443
std       14.121908
min        0.420000
25%       20.250000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [93]:
df['Age'].quantile(0.7)

35.0